src/cf/InformationRegisters/CRM_ХолдингиПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ХолдингиПартнеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Холдинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ХолдингиПартнеров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура УстановитьХолдингПартнера(Партнер, Холдинг) Экспорт
	Если Не ЗначениеЗаполнено(Партнер) Или ТипЗнч(Партнер) <> Тип("СправочникСсылка.Партнеры") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Холдинг) Тогда
		МенеджерЗаписи = РегистрыСведений.CRM_ХолдингиПартнеров.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Партнер = Партнер;
		МенеджерЗаписи.Холдинг = Холдинг;
		МенеджерЗаписи.Записать();
	Иначе
		НаборЗаписей = РегистрыСведений.CRM_ХолдингиПартнеров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Партнер.Установить(Партнер);
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры
#КонецЕсли
